Repository: Gigas002/GTiff2Tiles
Catalog: GTiff2Tiles.Core/Localization/Strings.*.resx
Languages: ru_ru

# AlreadyExist
source: {0} is already exist. Path:{1}
ru_ru: {0} уже существует. Путь:{1}

# DirectoryIsEmpty
source: Directory is empty. Please, select another directory. Path:{0}
ru_ru: Директория пустая. Пожалуйста, выберите другую директорию. Путь:{0}

# DirectoryIsntEmpty
source: Directory isn't empty. Please, select another directory. Path:{0}
ru_ru: Директория не пустая. Пожалуйста, выберите другую директорию. Путь:{0}

# DoesntExist
source: {0} doesn't exist. Path:{1}
ru_ru: {0} не существует. Путь:{1}

# DoesntSupportPlatform
source: {0} doesn't support current platform
ru_ru: {0} не поддерживается текущей платформой

# EstimatedTime
source: Estimated time:{0}Days:{1}, hours:{2}, minutes:{3}, seconds:{4}, ms:{5}
ru_ru: Осталось времени:{0}Дней:{1}, часов:{2}, минут:{3}, секунд:{4}, миллисекунд:{5}

# IsNull
source: {0} is null
ru_ru: {0} равен null

# LesserOrEqual
source: {0} is lesser or equal {1}
ru_ru: Параметр {0} меньше, или равен {1}

# LesserThan
source: {0} is lesser, than {1}
ru_ru: Параметр {0} меньше, чем {1}

# StringIsEmpty
source: {0} string is empty
ru_ru: Строка {0} пустая

# TooMuchBands
source: In the result tile is too much bands (>5)
ru_ru: В готовом тайле больше 5 каналов

# UnableToAddToCollection
source: Unable to add value to {0} collection
ru_ru: Невозможно добавить значение в коллекцию {0}

# UnableToCalculateCoordinates
source: Unable to calculate tile's coordinate borders
ru_ru: Невозможно вычислить границы координат тайла

# UnableToConfigure
source: Unable to configure {0}
ru_ru: Невозможно настроить {0}

# UnableToConvertCoordinatesToTiles
source: Unable to convert coordinates into tile numbers
ru_ru: Невозможно конвертировать координаты в номера тайлов

# UnableToCreate
source: Unable to create {0}. Path:{1}
ru_ru: Невозможно создать {0}. Путь:{1}

# UnableToCreateTile
source: Unable to create tile. X:{0}, Y:{1}
ru_ru: Невозможно создать тайл. X:{0}, Y:{1}

# UnableToGetCoordinates
source: Unable to get {0} coordinate borders or sizes
ru_ru: Невозможно получить координаты или размеры объекта {0}

# UnableToJoin
source: Unable to join {0}. X:{1}, Y:{2}
ru_ru: Невозможно склеить {0}. X:{1}, Y:{2}

# UnableToOpen
source: Unable to open {0}. Path:{1}
ru_ru: Невозможно открыть {0}. Путь:{1}

# WrongExtension
source: {0} extension isn't {1}. Path:{2}
ru_ru: Расширение файла {0} не {1}. Путь:{2}
